<!-- terraform cdk action for options with hash 0b809da01aafb79c1e01d326db7db432 -->
### ✅ Successfully planned Terraform CDK Stack 'maestro-dotnet'



<details><summary>Show Plan</summary>

```shell
Warning NETSDK1174: The abbreviation of -p for --project is deprecated. Please use --project.


App synth complete

maestro-dotnet  Initializing the backend...
maestro-dotnet  Successfully configured the backend "s3"! Terraform will automatically
                use this backend unless the backend configuration changes.
maestro-dotnet  Initializing provider plugins...
maestro-dotnet  - Finding hashicorp/aws versions matching "5.31.0"...
maestro-dotnet  - Installing hashicorp/aws v5.31.0...
maestro-dotnet  - Installed hashicorp/aws v5.31.0 (signed by HashiCorp)

                Terraform has created a lock file .terraform.lock.hcl to record the provider
                selections it made above. Include this file in your version control repository
                so that Terraform can guarantee to make the same selections by default when
                you run "terraform init" in the future.
maestro-dotnet  Terraform has been successfully initialized!

                You may now begin working with Terraform. Try running "terraform plan" to see
                any changes that are required for your infrastructure. All Terraform commands
                should now work.

                If you ever set or change modules or backend configuration for Terraform,
                rerun this command to reinitialize your working directory. If you forget, other
                commands will detect it and remind you to do so if necessary.
maestro-dotnet  - Fetching hashicorp/aws 5.31.0 for linux_amd64...
maestro-dotnet  - Retrieved hashicorp/aws 5.31.0 for linux_amd64 (signed by HashiCorp)
                - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
maestro-dotnet  Success! Terraform has validated the lock file and found no need for changes.
maestro-dotnet  aws_iam_role.maestro-web-role (maestro-web-role): Refreshing state... [id=maestro-web-role]
maestro-dotnet  aws_sqs_queue.dlq (dlq): Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/990455710365/maestro-event-dlq.fifo]
                aws_s3_bucket.maestro-lambda-deploys (maestro-lambda-deploys): Refreshing state... [id=maestro-lambda-deploys]
maestro-dotnet  aws_sqs_queue.event-queue (event-queue): Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/990455710365/maestro-event-queue.fifo]
maestro-dotnet  aws_s3_object.maestro-lambda-deploy-web (maestro-lambda-deploy-web): Refreshing state... [id=maestro-web-deploy-638398526399455019.zip]
maestro-dotnet  aws_lambda_function.maestro-web-dotnet (maestro-web-dotnet): Refreshing state... [id=maestro-web-dotnet-lambda]
maestro-dotnet  aws_lambda_function.maestro-events-dotnet-lambda (maestro-events-dotnet-lambda): Refreshing state... [id=maestro-event-dotnet-lambda]
maestro-dotnet  aws_lambda_event_source_mapping.maestro-events-dotnet (maestro-events-dotnet): Refreshing state... [id=f5c5c6e4-3cb8-4f1b-86e2-6fe2b2a5df30]
maestro-dotnet  Terraform used the selected providers to generate the following execution
                plan. Resource actions are indicated with the following symbols:
                  ~ update in-place
                -/+ destroy and then create replacement
maestro-dotnet  Terraform will perform the following actions:

                  # aws_lambda_function.maestro-events-dotnet-lambda (maestro-events-dotnet-lambda) will be updated in-place
                  ~ resource "aws_lambda_function" "maestro-events-dotnet-lambda" {
                        id                             = "maestro-event-dotnet-lambda"
                      ~ last_modified                  = "2024-01-03T04:24:24.000+0000" -> (known after apply)
                      ~ s3_key                         = "maestro-web-deploy-638398526399455019.zip" -> "maestro-web-deploy-638399089076955674.zip"
                        tags                           = {}
                        # (21 unchanged attributes hidden)

                      + environment {
                          + variables = {
                              + "CONNECTION_STRING"   = "Host=ep-black-king-873059.us-east-1.aws.neon.tech;Database=maestro;Username=alamarre;Password=NZ0yCh6lbeBu;"
                              + "Events__SqsQueueUrl" = "https://sqs.us-east-1.amazonaws.com/990455710365/maestro-event-queue.fifo"
                              + "JWT_SECRET"          = "maestro-secret-09ddab79-1054-46bd-88e2-59c19ec66775"
                              + "Metadata__TmdbKey"   = "7804cdacc8cf41f2c8b73a8b6b54ad96"
                            }
                        }

                        # (2 unchanged blocks hidden)
                    }

                  # aws_lambda_function.maestro-web-dotnet (maestro-web-dotnet) will be updated in-place
                  ~ resource "aws_lambda_function" "maestro-web-dotnet" {
                        id                             = "maestro-web-dotnet-lambda"
                      ~ last_modified                  = "2024-01-03T04:24:24.000+0000" -> (known after apply)
                      ~ s3_key                         = "maestro-web-deploy-638398526399455019.zip" -> "maestro-web-deploy-638399089076955674.zip"
                        tags                           = {}
                        # (21 unchanged attributes hidden)

                      ~ environment {
                          ~ variables = {
                              + "CONNECTION_STRING"   = "Host=ep-black-king-873059.us-east-1.aws.neon.tech;Database=maestro;Username=alamarre;Password=NZ0yCh6lbeBu;"
                              + "JWT_SECRET"          = "maestro-secret-09ddab79-1054-46bd-88e2-59c19ec66775"
                              + "Metadata__TmdbKey"   = "7804cdacc8cf41f2c8b73a8b6b54ad96"
                                # (1 unchanged element hidden)
                            }
                        }

                        # (2 unchanged blocks hidden)
                    }

                  # aws_s3_object.maestro-lambda-deploy-web (maestro-lambda-deploy-web) must be replaced
                -/+ resource "aws_s3_object" "maestro-lambda-deploy-web" {
                      + acl                    = (known after apply)
                      ~ bucket_key_enabled     = false -> (known after apply)
                      + checksum_crc32         = (known after apply)
                      + checksum_crc32c        = (known after apply)
                      + checksum_sha1          = (known after apply)
                      + checksum_sha256        = (known after apply)
                      ~ content_type           = "binary/octet-stream" -> (known after apply)
                      ~ etag                   = "f6a769c15297adcb8069e6f474674d7b-15" -> (known after apply)
                      ~ id                     = "maestro-web-deploy-638398526399455019.zip" -> (known after apply)
                      ~ key                    = "maestro-web-deploy-638398526399455019.zip" -> "maestro-web-deploy-638399089076955674.zip" # forces replacement
                      + kms_key_id             = (known after apply)
                      - metadata               = {} -> null
                      ~ server_side_encryption = "AES256" -> (known after apply)
                      ~ storage_class          = "STANDARD" -> (known after apply)
                      - tags                   = {} -> null
                      ~ tags_all               = {} -> (known after apply)
                      + version_id             = (known after apply)
                        # (3 unchanged attributes hidden)
                    }

                Plan: 1 to add, 2 to change, 1 to destroy.

                ─────────────────────────────────────────────────────────────────────────────

                Saved the plan to: plan

                To perform exactly these actions, run the following command to apply:
                    terraform apply "plan"


```

</details>